Autodesk.Revit.DB.Outline.ContainsOtherOutline(Autodesk.Revit.DB.Outline,System.Double)
Determine if this Outline contains another Outline to within tolerance.
Remarks:
If the tolerance is positive, the other Outline may extend the tolerance distance outside of this Outline in each coordinate.
If the tolerance is negative, the other Outline must lie at least the tolerance distance inside of this Outline in each coordinate to be a match.
otherOutline:
The outline to test for containment.
tolerance:
The tolerance to use when determining whether the point is contained. Defaults to zero.
Returns:
True if this outline contains the given outline, or false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Outline.Intersects(Autodesk.Revit.DB.Outline,System.Double)
Determine if this Outline intersects the input Outline to within a specified tolerance.
Remarks:
If the tolerance is positive, the outlines may be separated by the tolerance distance in each coordinate.
If the tolerance is negative, the outlines must overlap by at least the tolerance distance in each coordinate.
outline:
The outline to test for intersection with this one.
tolerance:
The tolerance to use when determining intersection. Defaults to zero.
Returns:
True if the given outline intersects this outline.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Outline.#ctor(Autodesk.Revit.DB.Outline)
Constructs a new copy of the input Outline object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011